.\" generated with Ronn/v0.7.3
.\" http://github.com/rtomayko/ronn/tree/0.7.3
.
.TH "DEBUGGER" "" "April 2012" "" ""
.
.nf

Stability: 3 \- Stable
.
.fi
.
.P
\fI!\-\- type=misc \-\-\fR
.
.P
V8 comes with an extensive debugger which is accessible out\-of\-process via a simple TCP protocol \fIhttp://code\.google\.com/p/v8/wiki/DebuggerProtocol\fR\. Node has a built\-in client for this debugger\. To use this, start Node with the \fBdebug\fR argument; a prompt will appear:
.
.IP "" 4
.
.nf

% node debug myscript\.js
< debugger listening on port 5858
connecting\.\.\. ok
break in /home/indutny/Code/git/indutny/myscript\.js:1
  1 x = 5;
  2 setTimeout(function () {
  3   debugger;
debug>
.
.fi
.
.IP "" 0
.
.P
Node\'s debugger client doesn\'t support the full range of commands, but simple step and inspection is possible\. By putting the statement \fBdebugger;\fR into the source code of your script, you will enable a breakpoint\.
.
.P
For example, suppose \fBmyscript\.js\fR looked like this:
.
.IP "" 4
.
.nf

// myscript\.js
x = 5;
setTimeout(function () {
  debugger;
  console\.log("world");
}, 1000);
console\.log("hello");
.
.fi
.
.IP "" 0
.
.P
Then once the debugger is run, it will break on line 4\.
.
.IP "" 4
.
.nf

% node debug myscript\.js
< debugger listening on port 5858
connecting\.\.\. ok
break in /home/indutny/Code/git/indutny/myscript\.js:1
  1 x = 5;
  2 setTimeout(function () {
  3   debugger;
debug> cont
< hello
break in /home/indutny/Code/git/indutny/myscript\.js:3
  1 x = 5;
  2 setTimeout(function () {
  3   debugger;
  4   console\.log("world");
  5 }, 1000);
debug> next
break in /home/indutny/Code/git/indutny/myscript\.js:4
  2 setTimeout(function () {
  3   debugger;
  4   console\.log("world");
  5 }, 1000);
  6 console\.log("hello");
debug> repl
Press Ctrl + C to leave debug repl
> x
5
> 2+2
4
debug> next
< world
break in /home/indutny/Code/git/indutny/myscript\.js:5
  3   debugger;
  4   console\.log("world");
  5 }, 1000);
  6 console\.log("hello");
  7
debug> quit
%
.
.fi
.
.IP "" 0
.
.P
The \fBrepl\fR command allows you to evaluate code remotely\. The \fBnext\fR command steps over to the next line\. There are a few other commands available and more to come\. Type \fBhelp\fR to see others\.
.
.SH "Watchers"
You can watch expression and variable values while debugging your code\. On every breakpoint each expression from the watchers list will be evaluated in the current context and displayed just before the breakpoint\'s source code listing\.
.
.P
To start watching an expression, type \fBwatch("my_expression")\fR\. \fBwatchers\fR prints the active watchers\. To remove a watcher, type \fBunwatch("my_expression")\fR\.
.
.SH "Commands reference"
.
.SS "Stepping"
.
.IP "\(bu" 4
\fBcont\fR, \fBc\fR \- Continue execution
.
.IP "\(bu" 4
\fBnext\fR, \fBn\fR \- Step next
.
.IP "\(bu" 4
\fBstep\fR, \fBs\fR \- Step in
.
.IP "\(bu" 4
\fBout\fR, \fBo\fR \- Step out
.
.IP "" 0
.
.SS "Breakpoints"
.
.IP "\(bu" 4
\fBsetBreakpoint()\fR, \fBsb()\fR \- Set breakpoint on current line
.
.IP "\(bu" 4
\fBsetBreakpoint(\'fn()\')\fR, \fBsb(\.\.\.)\fR \- Set breakpoint on a first statement in functions body
.
.IP "\(bu" 4
\fBsetBreakpoint(\'script\.js\', 1)\fR, \fBsb(\.\.\.)\fR \- Set breakpoint on first line of script\.js
.
.IP "\(bu" 4
\fBclearBreakpoint\fR, \fBcb(\.\.\.)\fR \- Clear breakpoint
.
.IP "" 0
.
.SS "Info"
.
.IP "\(bu" 4
\fBbacktrace\fR, \fBbt\fR \- Print backtrace of current execution frame
.
.IP "\(bu" 4
\fBlist(5)\fR \- List scripts source code with 5 line context (5 lines before and after)
.
.IP "\(bu" 4
\fBwatch(expr)\fR \- Add expression to watch list
.
.IP "\(bu" 4
\fBunwatch(expr)\fR \- Remove expression from watch list
.
.IP "\(bu" 4
\fBwatchers\fR \- List all watchers and their values (automatically listed on each breakpoint)
.
.IP "\(bu" 4
\fBrepl\fR \- Open debugger\'s repl for evaluation in debugging script\'s context
.
.IP "" 0
.
.SS "Execution control"
.
.IP "\(bu" 4
\fBrun\fR \- Run script (automatically runs on debugger\'s start)
.
.IP "\(bu" 4
\fBrestart\fR \- Restart script
.
.IP "\(bu" 4
\fBkill\fR \- Kill script
.
.IP "" 0
.
.SS "Various"
.
.IP "\(bu" 4
\fBscripts\fR \- List all loaded scripts
.
.IP "\(bu" 4
\fBversion\fR \- Display v8\'s version
.
.IP "" 0
.
.SH "Advanced Usage"
The V8 debugger can be enabled and accessed either by starting Node with the \fB\-\-debug\fR command\-line flag or by signaling an existing Node process with \fBSIGUSR1\fR\.
